In [ ]:
import pandas as pd

In [ ]:
pd.Series?

In [ ]:
animals = ['Lion', 'Tiger', 'Elephant']

In [ ]:
animals

In [ ]:
pd.Series(animals)

In [ ]:
import pandas as pd

In [ ]:
pd.Series?

In [ ]:
animals

In [ ]:
pd.Series(animals)

In [ ]:
numbers = [1,2, 3, 4]

In [ ]:
numbers

In [ ]:
pd.Series(numbers)

In [ ]:
import numpy as np
np.nan == None

In [ ]:
np.isnan(np.nan)

In [24]:
sports = {'Basketball': 'Massachusetts',
         'Football':'Ohio',
         'Baseball': 'England'}
s = pd.Series(sports)
s

Baseball            England
Basketball    Massachusetts
Football               Ohio
dtype: object

In [25]:
s.index

Index(['Baseball', 'Basketball', 'Football'], dtype='object')

In [27]:
tea = pd.Series(['Orange Blossom Oolong', 'White Rose', 'Earl Grey Green'], index=['Oolong', 'White', 'Green'])
tea

Oolong    Orange Blossom Oolong
White                White Rose
Green           Earl Grey Green
dtype: object

In [29]:
tea.iloc[0]

'Orange Blossom Oolong'

In [30]:
tea.loc['White']

'White Rose'

In [31]:
n = pd.Series([144.00, 120, 115, 101])
n

0    144.0
1    120.0
2    115.0
3    101.0
dtype: float64

In [32]:
total = 0
for item in n:
    total += item
print(total)

480.0

In [33]:
np

In [34]:
total = np.sum(n)
print(total)

480.0

In [35]:
n = pd.Series(np.random.randint(0, 1000, 10000))
n.head()

0    657
1    843
2    632
3    978
4    226
dtype: int64

In [36]:
n.tail()

9995    471
9996    694
9997    801
9998    937
9999    615
dtype: int64

In [37]:
len(n)

10000

In [38]:
%%timeit -n 100
summary = 0
for item in n:
    summary += item

836 µs ± 32.4 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [39]:
n += 2
n.head()

0    659
1    845
2    634
3    980
4    228
dtype: int64

In [44]:
for label, value in n.iteritems():
    n.at[label] = value + 2
    n.head()

In [ ]:
my_numpy_array = np.random.rand(3)
my_numpy_array

In [3]:
import pandas as pd

In [4]:
purchase_1 = pd.Series({'Name': 'Chris',
                     'Item': 'Hat',
                     'Cost': 10})
purchase_2 = pd.Series({'Name': 'Carol',
                       'Item':'Wallet',
                       'Cost': 20})

In [5]:
purchase_1

Cost       10
Item      Hat
Name    Chris
dtype: object

In [6]:
df = pd.DataFrame([purchase_1, purchase_2], index=['Store 1', 'Store 2'])
df

         Cost    Item   Name
Store 1    10     Hat  Chris
Store 2    20  Wallet  Carol

In [7]:
df.loc['Store 2']

Cost        20
Item    Wallet
Name     Carol
Name: Store 2, dtype: object

In [8]:
type(df.loc['Store 1'])

pandas.core.series.Series

In [9]:
df.loc['Store 1', 'Cost']

10

In [10]:
df.loc['Store 1']['Cost']

10

In [11]:
df.loc[:, ['Name', 'Cost']] # all names and costs

          Name  Cost
Store 1  Chris    10
Store 2  Carol    20

In [12]:
df.drop('Store 1')

         Cost    Item   Name
Store 2    20  Wallet  Carol

In [13]:
df

         Cost    Item   Name
Store 1    10     Hat  Chris
Store 2    20  Wallet  Carol

In [17]:
copy_df = df.copy()
copy_df = copy_df.drop('Store 1')
copy_df

         Cost    Item   Name
Store 2    20  Wallet  Carol

In [18]:
copy_df.drop?

In [19]:
del copy_df['Name']
copy_df

         Cost    Item
Store 2    20  Wallet

In [20]:
df['Location'] = None
df

         Cost    Item   Name Location
Store 1    10     Hat  Chris     None
Store 2    20  Wallet  Carol     None

In [ ]:
for col in df.columns:
    if col[:2]